#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.s3origin["davidbornitz.dev"].aws_s3_bucket.bucket: Refreshing state... [id=davidbornitz.dev]
aws_cloudfront_origin_access_control.davidbornitz: Refreshing state... [id=E2IARHGO3S8MHZ]
module.s3origin["resume.davidbornitz.dev"].aws_s3_bucket.bucket: Refreshing state... [id=resume.davidbornitz.dev]
aws_route53_zone.davidbornitz: Refreshing state... [id=Z04601461HBLV7APEL0VR]
aws_acm_certificate.davidbornitz: Refreshing state... [id=arn:aws:acm:us-east-1:085879623427:certificate/0c98caac-a15d-43ff-acfb-5215ebc4a3fb]
aws_route53_record.cert_validation["*.davidbornitz.dev"]: Refreshing state... [id=Z04601461HBLV7APEL0VR__b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev._CNAME]
aws_route53_record.cert_validation["davidbornitz.dev"]: Refreshing state... [id=Z04601461HBLV7APEL0VR__b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev._CNAME]
module.s3origin["davidbornitz.dev"].aws_s3_bucket_website_configuration.website: Refreshing state... [id=davidbornitz.dev]
module.s3origin["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Reading...
module.s3origin["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Reading...
module.s3origin["resume.davidbornitz.dev"].aws_s3_bucket_website_configuration.website: Refreshing state... [id=resume.davidbornitz.dev]
module.s3origin["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=405747234]
module.s3origin["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=3524774637]
module.s3origin["resume.davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=resume.davidbornitz.dev]
module.s3origin["davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=davidbornitz.dev]
aws_acm_certificate_validation.davidbornitz: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_cloudfront_distribution.davidbornitz: Refreshing state... [id=E23A18Y83ZWJHV]
module.bucket-access["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Reading...
module.bucket-access["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Reading...
aws_route53_record.record["resume.davidbornitz.dev"]: Refreshing state... [id=Z04601461HBLV7APEL0VR_resume.davidbornitz.dev_A]
module.bucket-access["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=3556308804]
aws_route53_record.record["davidbornitz.dev"]: Refreshing state... [id=Z04601461HBLV7APEL0VR_davidbornitz.dev_A]
module.bucket-access["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=2012964748]
module.bucket-access["resume.davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=resume.davidbornitz.dev]
module.bucket-access["davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=davidbornitz.dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.s3origin["davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access will be updated in-place
  ~ resource "aws_s3_bucket_policy" "allow_cloudfront_access" {
        id     = "davidbornitz.dev"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::085879623427:distribution/E23A18Y83ZWJHV"
                            }
                        } -> null
                        # (4 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.s3origin["davidbornitz.dev"].aws_s3_object.website["index.html"] will be created
  + resource "aws_s3_object" "website" {
      + acl                    = (known after apply)
      + bucket                 = "davidbornitz.dev"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=0"
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = "b23b8d6b72eaa2aeba3496231710d00d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "modules/s3origin/content/davidbornitz.dev/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.s3origin["davidbornitz.dev"].aws_s3_object.website["styles.css"] will be created
  + resource "aws_s3_object" "website" {
      + acl                    = (known after apply)
      + bucket                 = "davidbornitz.dev"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=0"
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css"
      + etag                   = "90d0c830f4c2647dce0d2024a9e885e8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "styles.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "modules/s3origin/content/davidbornitz.dev/styles.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.s3origin["resume.davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access will be updated in-place
  ~ resource "aws_s3_bucket_policy" "allow_cloudfront_access" {
        id     = "resume.davidbornitz.dev"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::085879623427:distribution/E23A18Y83ZWJHV"
                            }
                        } -> null
                        # (4 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.s3origin["resume.davidbornitz.dev"].aws_s3_object.website["index.html"] will be created
  + resource "aws_s3_object" "website" {
      + acl                    = (known after apply)
      + bucket                 = "resume.davidbornitz.dev"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=0"
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = "095cc44e148acbb9d18ee3032fbeb128"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "modules/s3origin/content/resume.davidbornitz.dev/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.s3origin["resume.davidbornitz.dev"].aws_s3_object.website["styles.css"] will be created
  + resource "aws_s3_object" "website" {
      + acl                    = (known after apply)
      + bucket                 = "resume.davidbornitz.dev"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=0"
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css"
      + etag                   = "90d0c830f4c2647dce0d2024a9e885e8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "styles.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "modules/s3origin/content/resume.davidbornitz.dev/styles.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 4 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @davidbornitz, Action: `pull_request`*